In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('sample_data/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
x=df[['Pclass','Sex','Age','Fare']].copy()
y=df.Survived

In [4]:
x.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [5]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [6]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
pclass=le.fit_transform(df.Pclass)
sex=le.fit_transform(df.Sex)

In [8]:
x.Pclass=pclass
x.Sex=sex
x.head()

   Pclass  Sex   Age     Fare
0       2    1  22.0   7.2500
1       0    0  38.0  71.2833
2       2    0  26.0   7.9250
3       0    0  35.0  53.1000
4       2    1  35.0   8.0500

In [10]:
from sklearn.model_selection import train_test_split
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=.2,random_state=99)

In [11]:
from sklearn.tree import DecisionTreeClassifier
tree=DecisionTreeClassifier()
tree.fit(xtrain,ytrain)
tree.score(xtest,ytest)

0.7932960893854749